Repository: arrenwu/resynthesizer
Catalog: po/*.po
Languages: cs

source: You must first select a region to heal.
cs: Nejprve vyberte oblast k ošetření.

source: Heal the selection from surroundings as if using the heal tool.
cs: Ošetřit výběr z okolí jako při použití nástroje ošetření.

source: _Heal Selection...
cs: _Ošetřit výběr...

source: Context sampling width (pixels)
cs: Šířka kontextu vzorkování (v pixelech)

source: Sample from
cs: Vzorek z

source: All around
cs: Všude okolo

source: Sides
cs: Strany

source: Above and below
cs: Nad a pod

source: Filling order
cs: Pořadí plnění

source: Random
cs: Náhodné

source: Inwards towards center
cs: Z krajů doprostřed

source: Outwards from center
cs: Z prostředka do krajů

source: Removes alpha channel by synthesis. Fill outward for edges, inward for holes.
cs: Odstraní alfa kanál pomocí syntézy. Kraje plní od prostředka, díry od krajů.

source: Heal Transparency...
cs: Ošetřit průhlednost...

source: The style source cannot be of mode INDEXED
cs: Zdroj stylu nemůže být módu INDEXED

source: Transfer style (color and surface) from a chosen source to the active layer.
cs: Převeď styl (barvu a povrch) z vybraného zdroje do aktivní vrstvy.

source: Style...
cs: Styl...

source: Source of style
cs: Zdroj stylu

source: Percent transfer
cs: Průběh přenosu

source: Map by
cs: Mapovat s

source: Color and brightness
cs: Barva a jas

source: Brightness only
cs: Pouze jas

source: Create a new image with texture from the current image or selection. Optionally, create image edges suited for further, seamless tiling.
cs: Vytvořit nový obrázek s texturou z aktuálního obrázku nebo výběru. Volitelně vytvořit okraje obrázku vhodné pro další, bezešvé dlaždicování.

source: _Texture...
cs: _Textura...

source: Ratio of size of new image to source selection
cs: Poměr velikosti nového obrázku k výběru zdroje

source: Make new image edges suitable for seamless tiling
cs: Vytvořit nové okraje obrázku vhodné pro bezešvé dlaždicování

source: Enlarge image and synthesize to sharpen.
cs: Zvětšit obrázek a syntetizovat pro zaostření.

source: Enlarge & sharpen...
cs: Zvětšit a zaostřit...

source: Scale by
cs: Škálovat v poměru

source: Seamlessly fill with a pattern using synthesis.
cs: Bezešvé vyplnění vzorem pomocí syntézy.

source: _Fill with pattern seamless...
cs: _Vyplnit vzorem bezešvým...

source: Pattern
cs: Vzor

source: Sharpen image by synthesis.
cs: Zostřit obrázek syntézou.

source: Sharpen by synthesis...
cs: Zostřit syntézou.

source: Sharpening
cs: Zaostření

source: A layer must be active, not a channel.
cs: Aktivní musí být vrstva, nikoli kanál.

source: Enlarge image by synthesizing a border that matches the edge, maintaining perspective. Works best for small enlargement of natural edges. Undo a Crop instead, if possible!
cs: Zvětšit obrázek syntetizováním ohraničení, který odpovídá okraji, ale při zachování perspektivy. Funguje nejlépe pro malé zvětšení přirozených okrajů. Pokud je to možné, zrušit oříznutí!

source: Uncrop...
cs: Doplnit okolí...

source: Percent enlargement
cs: Procento zvětšění

source: Make tiles, apply themes, render texture, remove features, etc.
cs: Vytvořit dlaždicování, aplikovat motivy, vykreslit texturu, odebrat prvky atd.

source: _Resynthesize...
cs: _Resyntetizovat...

source: Context
cs: Kontext

source: Random order, without context
cs: Náhodné pořadí bez kontextu

source: Random order, with context
cs: Náhodné pořadí s kontextem

source: Randomized bands, concentric, inwards
cs: Náhodné pruhy, soustředné, směřující dovnitř

source: Randomized bands, horizontally, inwards (i.e. squeezing from top and bottom)
cs: Náhodné pruhy, horizontálně, směrem dovnitř (tj. stlačování shora a zdola)

source: Randomized bands, vertically, inwards (i.e. squeezing from left and right)
cs: Náhodné pruhy, svisle, směrem dovnitř (tj. stlačování zleva a zprava)

source: Randomized bands, concentric, outwards (e.g. for uncrop)
cs: Náhodné pruhy, soustředné, směrem ven (např. pro rozšíření okolí)

source: Randomized bands, horizontally, outwards, (i.e. expanding to top and bottom)
cs: Náhodné pruhy, horizontálně, směrem ven (tj. rozšiřující se nahoru a dolů)

source: Randomized bands, vertically, outwards (i.e. expanding to left and right)
cs: Náhodné pruhy, svisle, směrem ven (tj. rozšiřující se doleva a doprava)

source: Randomized bands, concentric, inwards and outwards (i.e. squeezing in and out a donut)
cs: Náhodné pruhy, soustředné, dovnitř a ven (tj. vtlačování a vytahování donutu)

source: Resynthesize
cs: Resyntetizovat

source: _Cancel
cs: _Zrušit

source: Options
cs: Možnosti

source: Tweaks
cs: Konfigurace

source: Input
cs: Vstup

source: Texture source
cs: Zdroj textury

source: Output
cs: Výstup

source: Make horizontally tileable
cs: Umožnit horizontální dlaždicování

source: Make vertically tileable
cs: Umožnit vertikální dlaždicování

source: Texture transfer
cs: Přenos textury

source: Use texture transfer
cs: Použít přenos textury

source: Input map
cs: Mapa vstupu

source: Output map
cs: Mapa výstupu

source: Map importance
cs: Důležitost mapy

source: Resynthesizer operates by copying pixels, one at a time, from the input to the output. A neighbourhood of nearby pixels in the output are compared with neighbourhoods of pixels in the input. The pixel at the center of the best matching neighbourhood is copied to the output.
cs: Resyntetizátor funguje tak, že kopíruje pixely jeden po druhém ze vstupu na výstup. Okolí blízkých pixelů na výstupu je porovnáno s okolím pixelů na vstupu. Pixel ve středu nejlépe odpovídajícího okolí je zkopírován na výstup.

source: Neighbourhood size
cs: Velikost okolí

source: - How many nearby pixels in the output are to be used?
cs: - Kolik blízkých pixelů ve výstupu se má použít?

source: Search thoroughness
cs: Důkladnost vyhledávání

source: - How many locations in the input are examined?
cs: - Kolik míst na vstupu je prozkoumáno?

source: Sensitivity to outliers
cs: Citlivost na odlehlé hodnoty

source: - To what extent does a very bad match on a single pixel disqualify a location?
cs: - Do jaké míry diskvalifikuje lokalitu velmi špatná shoda na jediném pixelu?

source: Incompatible image mode.
cs: Nekompatibilní režim obrázku.

source: Resynthesizer failed to get parameters.
cs: Resyntetizátoru se nepodařilo získat parametry.

source: The input texture and output image must have the same number of color channels.
cs: Vstupní textura a výstupní obrázek musí mít stejný počet barevných kanálů.

source: The input and output maps must have the same mode
cs: Vstupní a výstupní mapy musí mít stejný mód

source: The input map should be the same size as the input texture image
cs: Vstupní mapa by měla mít stejnou velikost jako vstupní obrázek textury

source: The output map should be the same size as the output image
cs: Výstupní mapa by měla mít stejnou velikost jako výstupní obrázek

source: synthesizing...
cs: syntetizuji...

source: The texture source is empty. Does any selection include non-transparent pixels?
cs: Zdroj textury je prázdný. Obsahuje některý výběr neprůhledné pixely?

source: The output layer is empty. Does any selection have visible pixels in the active layer?
cs: Výstupní vrstva je prázdná. Obsahuje nějaký výběr v aktivní vrstvě viditelné pixely?
